In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [12]:
employee = pd.read_csv('C:/Users/dell/Desktop/shubham/Stuff/Employee_Details.csv')
employee

    hire_date  emp_id  emp_name  salary
0   12/2/2020       1   Sandhya   12000
1   12/2/2020       2    Sushil   12000
2   12/2/2020       3     Rahul   12000
3   12/2/2020       4     Toros   12000
4   13/2/2020       5      Kent   12000
5   13/2/2020       6   Trident   20000
6   13/2/2020       7     Rohan   22000
7   15/2/2020       8    Ananya   10000
8   15/2/2020       9     Swati   10000
9   15/2/2020      10  Priyanka   25000
10  15/2/2020      11      Opie   25000
11  15/2/2020      12     Susan   25000
12  20/3/2020      13     Trace   25000

In [14]:
X = employee.iloc[:, :-1].values
y = employee.iloc[:,1].values
y

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13], dtype=int64)